soap-api-delete.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:urn1="urn:sobject.enterprise.soap.sforce.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
    <urn:SessionHeader>
      <urn:sessionId>{{SessionId}}</urn:sessionId>
    </urn:SessionHeader>
  </soapenv:Header>
  <soapenv:Body>
    <urn:delete>
      <urn:ids>[RecordIDToDelete]</urn:ids>
      <urn:ids>[RecordIDToDelete]</urn:ids>
    </urn:delete>
  </soapenv:Body>
</soapenv:Envelope>
